html/docker/kubernates-handbook/manual/security/best_practise.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Kubernetes 集群安全性配置最佳实践</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="strategy.html"> UP </a>
 |
 <a accesskey="H" href="security.html"> HOME </a>
</div><div id="content">
<h1 class="title">Kubernetes 集群安全性配置最佳实践</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga6064ae">端口</a></li>
<li><a href="#org5b7e577">Kubernetes 安全扫描工具 kube-bench</a></li>
<li><a href="#org73ee258">API 设置</a>
<ul>
<li><a href="#orgd79b30f">授权模式和匿名认证</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga6064ae" class="outline-2">
<h2 id="orga6064ae">端口</h2>
<div class="outline-text-2" id="text-orga6064ae">
<p>
请注意管理好以下端口：
</p>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">端口</td>
<td class="org-left">进程</td>
<td class="org-left">描述</td>
</tr>

<tr>
<td class="org-left">4149/TCP</td>
<td class="org-left">kubelet</td>
<td class="org-left">用于查询容器监控指标的 cAdvisor 端口</td>
</tr>

<tr>
<td class="org-left">10250/TCP</td>
<td class="org-left">kubelet</td>
<td class="org-left">访问节点的 API 端口</td>
</tr>

<tr>
<td class="org-left">10255/TCP</td>
<td class="org-left">kubelet</td>
<td class="org-left">未认证的只读端口，允许访问节点状态</td>
</tr>

<tr>
<td class="org-left">10256/TCP</td>
<td class="org-left">kube-proxy</td>
<td class="org-left">kube-proxy 的健康检查服务端口</td>
</tr>

<tr>
<td class="org-left">9099/TCP</td>
<td class="org-left">calico-felix</td>
<td class="org-left">calico 的健康检查服务端口（如果使用 calico/canal）</td>
</tr>

<tr>
<td class="org-left">6443/TCP</td>
<td class="org-left">kube-apiserver</td>
<td class="org-left">Kubernetes API 端口</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org5b7e577" class="outline-2">
<h2 id="org5b7e577">Kubernetes 安全扫描工具 kube-bench</h2>
<div class="outline-text-2" id="text-org5b7e577">
<p>
kube-bench 可以消除大约 kubernetes 集群中 95％的配置缺陷。通过应用 CIS Kubernetes Benchmark 来检查 master 节点、node 节点及其控制平面组件，从而确保集群设置了特定安全准则
</p>
</div>
</div>
<div id="outline-container-org73ee258" class="outline-2">
<h2 id="org73ee258">API 设置</h2>
<div class="outline-text-2" id="text-org73ee258">
</div>
<div id="outline-container-orgd79b30f" class="outline-3">
<h3 id="orgd79b30f">授权模式和匿名认证</h3>
<div class="outline-text-3" id="text-orgd79b30f">
<pre class="example" id="org91b45b1">
像 kops 这样的一些安装程序会为集群使用 AlwaysAllow 授权模式，这将授予任何经过身份验证的实体拥有完全访问集群的权限
</pre>
<p>
应该使用 RBAC 基于角色的访问控制：
</p>
<ul class="org-ul">
<li>检查 kube-apiserver 进程的 &#x2013;authorization-mode 参数</li>
<li>要强制进行身份验证，请确保通过设置 &#x2013;anonymous-auth = false 禁用匿名身份验证</li>
</ul>

<pre class="example" id="org535e5d8">
注意这不影响 Kubelet 授权模式

kubelet 本身公开了一个 API 来执行命令，通过它可以完全绕过 Kubernetes API
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="strategy.html">Previous：认证策略</a></td>
<td class="org-left"><a href="security.html">Home：安全</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
